Ran Plan for 3 projects:

1. project: `rds-prod` dir: `terraform/rds` workspace: `default`
1. project: `atlantis-prod` dir: `terraform/atlantis` workspace: `default`
1. project: `ecr-fileflow-prod` dir: `terraform/ecr/fileflow` workspace: `default`
---

### 1. project: `rds-prod` dir: `terraform/rds` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place

Terraform will perform the following actions:

  # aws_db_parameter_group.main will be updated in-place
~ resource "aws_db_parameter_group" "main" {
        id           = "prod-shared-mysql-params"
        name         = "prod-shared-mysql-params"
        tags         = {
            "CostCenter"  = "engineering"
            "DataClass"   = "sensitive"
            "Description" = "Shared MySQL database for multiple services"
            "Environment" = "prod"
            "Lifecycle"   = "production"
            "ManagedBy"   = "Terraform"
            "Name"        = "prod-shared-mysql-params"
            "Owner"       = "platform-team@ryuqqq.com"
            "Project"     = "shared-infrastructure"
            "Service"     = "shared-database"
            "Stack"       = "rds"
            "Team"        = "platform-team"
        }
        # (7 unchanged attributes hidden)

      - parameter {
          - apply_method = "pending-reboot" -> null
          - name         = "innodb_buffer_pool_size" -> null
          - value        = "{DBInstanceClassMemory*3/4}" -> null
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "innodb_buffer_pool_size"
          + value        = "{DBInstanceClassMemory*3/4}"
        }

        # (6 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p rds-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FInfrastructure%252Fterraform%252Frds%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p rds-prod
  ```
Plan: 0 to add, 1 to change, 0 to destroy.

---
### 2. project: `atlantis-prod` dir: `terraform/atlantis` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
- destroy

Terraform will perform the following actions:

  # aws_secretsmanager_secret_version.atlantis-github-app[0] will be destroyed
  # (because index [0] is out of range for count)
- resource "aws_secretsmanager_secret_version" "atlantis-github-app" {
      - arn            = "arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:atlantis/github-app-v2-prod-oxfqDt" -> null
      - id             = "arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:atlantis/github-app-v2-prod-oxfqDt|terraform-20251012140026441300000001" -> null
      - secret_id      = "arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:atlantis/github-app-v2-prod-oxfqDt" -> null
      - secret_string  = (sensitive value) -> null
      - version_id     = "terraform-20251012140026441300000001" -> null
      - version_stages = [
          - "AWSCURRENT",
        ] -> null
        # (1 unchanged attribute hidden)
    }

  # aws_secretsmanager_secret_version.atlantis-webhook-secret[0] will be destroyed
  # (because index [0] is out of range for count)
- resource "aws_secretsmanager_secret_version" "atlantis-webhook-secret" {
      - arn            = "arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:atlantis/webhook-secret-v2-prod-JSD4P7" -> null
      - id             = "arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:atlantis/webhook-secret-v2-prod-JSD4P7|terraform-20251012142201040100000001" -> null
      - secret_id      = "arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:atlantis/webhook-secret-v2-prod-JSD4P7" -> null
      - secret_string  = (sensitive value) -> null
      - version_id     = "terraform-20251012142201040100000001" -> null
      - version_stages = [
          - "AWSCURRENT",
        ] -> null
        # (1 unchanged attribute hidden)
    }

Plan: 0 to add, 0 to change, 2 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p atlantis-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FInfrastructure%252Fterraform%252Fatlantis%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p atlantis-prod
  ```
Plan: 0 to add, 0 to change, 2 to destroy.

---
### 3. project: `ecr-fileflow-prod` dir: `terraform/ecr/fileflow` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ssm_parameter.fileflow-repository-url is tainted, so must be replaced
-/+ resource "aws_ssm_parameter" "fileflow-repository-url" {
      ~ arn             = "arn:aws:ssm:ap-northeast-2:646886795421:parameter/shared/ecr/fileflow-repository-url" -> (known after apply)
      ~ data_type       = "text" -> (known after apply)
      + has_value_wo    = (known after apply)
      ~ id              = "/shared/ecr/fileflow-repository-url" -> (known after apply)
      + insecure_value  = (known after apply)
      + key_id          = (known after apply)
        name            = "/shared/ecr/fileflow-repository-url"
        tags            = {
            "Component"   = "ecr"
            "CostCenter"  = "engineering"
            "DataClass"   = "confidential"
            "Environment" = "prod"
            "Lifecycle"   = "production"
            "Name"        = "fileflow-ecr-repository-url-export"
            "Owner"       = "platform-team@ryuqqq.com"
            "Service"     = "fileflow"
        }
      ~ tier            = "Standard" -> (known after apply)
      ~ version         = 1 -> (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p ecr-fileflow-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FInfrastructure%252Fterraform%252Fecr%252Ffileflow%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p ecr-fileflow-prod
  ```
Plan: 1 to add, 0 to change, 1 to destroy.

---
### Plan Summary

3 projects, 3 with changes, 0 with no changes, 0 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```